perf/heavy/breakpoint.yaml
config:
  environments:
    node:
      target: 'http://localhost:5555/node'
      plugins:
        statsd:
          host: localhost
          port: 8125
          prefix: "artillery-node"

  pool: 50 # All HTTP requests from all virtual users will be sent over the same connections

  phases:
    - name: Inicio
      duration: 20
      arrivalRate: 1
    - name: Fase 2
      duration: 20
      arrivalRate: 2
    - name: Fase 3
      duration: 20
      arrivalRate: 3
    - name: Fase 4
      duration: 20
      arrivalRate: 4
    - name: Fase 5
      duration: 20
      arrivalRate: 5
    
scenarios:
  - name: Heavy Breakpoint (/heavy)
    flow:
      - get:
          url: '/heavy'