perf/heavy/endurance.yaml
config:
    environments:
      node:
        target: 'http://localhost:5555/node'
        plugins:
          statsd:
            host: localhost
            port: 8125
            prefix: "artillery-node"
  
    pool: 50 # All HTTP requests from all virtual users will be sent over the same connections
  
    phases:
      - name: Subida
        duration: 30
        arrivalRate: 1
        rampTo: 1
      - name: Constante
        duration: 200
        arrivalRate: 1
      - name: Reset
        arrivalRate: 1
        duration: 20

scenarios:
  - name: heavy Short (/heavy)
    flow:
      - get:
          url: '/heavy'